In [1]:
import sqlite3
import pandas as pd

In [2]:
con = sqlite3.connect('project_db.db')
curs = con.cursor()

In [3]:
def execute_commands(sql_file, sep, database):
    '''
    This function execute all commands of a .sql file.
    It separates the commands using a separator set
    by the user
    '''
    try:
        con = sqlite3.connect(f'{database}')
        curs = con.cursor()
        sql_file = open(f'{sql_file}', "r")
        content_sql = sql_file.read().split(f'{sep}')
        for command in content_sql:
            curs.execute(command)
        print('All commands were succesfully executed.')
    except:
        print('There is something wrong. \nCheck parameters then try again.')

In [4]:
execute_commands(sql_file='projeto_1.sql', sep='\n\n', database='project_db.db')

All commands were succesfully executed.

In [5]:
maint_df = pd.read_csv('PdM_maint_fail.csv')
maint_df.head()

              datetime  machineID   comp  failure
0  2014-06-01 06:00:00          1  comp2        0
1  2014-07-16 06:00:00          1  comp4        0
2  2014-07-31 06:00:00          1  comp3        0
3  2014-12-13 06:00:00          1  comp1        0
4  2015-01-05 06:00:00          1  comp4        1

In [6]:
maint_df['comp'] = [component[-1] for component in maint_df['comp'].values]
maint_df.head()

              datetime  machineID comp  failure
0  2014-06-01 06:00:00          1    2        0
1  2014-07-16 06:00:00          1    4        0
2  2014-07-31 06:00:00          1    3        0
3  2014-12-13 06:00:00          1    1        0
4  2015-01-05 06:00:00          1    4        1

In [7]:
for index, row in maint_df.iterrows():
    curs.execute('INSERT INTO maintenance (datetime, machine_id, component_id, failure) VALUES (?,?,?,?)',\
        [row.datetime, row.machineID, row.comp, row.failure])
con.commit()

In [16]:
error_df = pd.read_csv('PdM_errors.csv')
error_df.head()

              datetime  machineID errorID
0  2015-01-03 07:00:00          1  error1
1  2015-01-03 20:00:00          1  error3
2  2015-01-04 06:00:00          1  error5
3  2015-01-10 15:00:00          1  error4
4  2015-01-22 10:00:00          1  error4

In [17]:
error_df['errorID'] = [error[-1] for error in error_df['errorID'].values]
error_df.head()

              datetime  machineID errorID
0  2015-01-03 07:00:00          1       1
1  2015-01-03 20:00:00          1       3
2  2015-01-04 06:00:00          1       5
3  2015-01-10 15:00:00          1       4
4  2015-01-22 10:00:00          1       4

In [21]:
for index, row in error_df.iterrows():
    curs.execute('INSERT INTO error (datetime, machine_id, error_type_id) VALUES (?,?,?)',\
        [row.datetime, row.machineID, row.errorID])
con.commit()

In [22]:
machine_df = pd.read_csv('PdM_machines.csv')
machine_df.head()

   machineID   model  age
0          1  model3   18
1          2  model4    7
2          3  model3    8
3          4  model3    7
4          5  model3    2

In [23]:
machine_df['model'] = [machine[-1] for machine in machine_df['model'].values]
machine_df.head()

   machineID model  age
0          1     3   18
1          2     4    7
2          3     3    8
3          4     3    7
4          5     3    2

In [26]:
for index, row in machine_df.iterrows():
    curs.execute('INSERT INTO machine (id, model_id, age) VALUES (?,?,?)',\
        [row.machineID, row.model, row.age])
con.commit()

In [27]:
telemetry_df = pd.read_csv('PdM_telemetry.csv')
telemetry_df.head()

,datetime,machineID,volt,rotate,pressure,vibration
0,2015-01-01 06:00:00,1,176.217853,418.504078,113.077935,45.087686
1,2015-01-01 07:00:00,1,162.879223,402.747490,95.460525,43.413973
2,2015-01-01 08:00:00,1,170.989902,527.349825,75.237905,34.178847
3,2015-01-01 09:00:00,1,162.462833,346.149335,109.248561,41.122144
4,2015-01-01 10:00:00,1,157.610021,435.376873,111.886648,25.990511

In [28]:
for index, row in telemetry_df.iterrows():
    curs.execute('INSERT INTO telemetry (datetime, machine_id, volt, rotate, pressure, vibration) VALUES (?,?,?,?,?,?)',\
        [row.datetime, row.machineID, row.volt, row.rotate, row.pressure, row.vibration])
con.commit()